; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v4 ?v13)
             (pred_6 ?v8 ?v3)
             (pred_3 ?v4 ?v3)
             (pred_2 ?v5 ?v4 )
	     (pred_7 ?v4)
             (pred_9 ?v2)
             (pred_11 ?v8)
             (pred_8 ?v3)
             (pred_12 ?v4)
             (pred_10 ?v8)
             (pred_5 ?v4)
             (pred_1 ))



(:action op_3
:parameters (?v12 ?v11 ?v6 ?v10)
:precondition (and (pred_9 ?v12) (pred_9 ?v11) (pred_11 ?v6) (pred_8 ?v10)
          (pred_4 ?v12 ?v11) (pred_6 ?v6 ?v10)
                   (pred_3 ?v11 ?v10) (pred_7 ?v12) 
                   (pred_12 ?v11) (pred_10 ?v6))
:effect (and  (pred_5 ?v11) (not (pred_12 ?v11))))


(:action op_5
:parameters (?v12 ?v9)
:precondition (and (pred_9 ?v12) (pred_9 ?v9)
               (pred_7 ?v12) (pred_4 ?v12 ?v9) (pred_5 ?v9))
:effect (and (pred_7 ?v9) (not (pred_7 ?v12))))

(:action op_2
:parameters (?v12 ?v6)
:precondition (and (pred_9 ?v12) (pred_11 ?v6) 
                  (pred_7 ?v12) (pred_2 ?v6 ?v12) (pred_1 ))
:effect (and (pred_10 ?v6)
   (not (pred_2 ?v6 ?v12)) (not (pred_1 ))))


(:action op_1
:parameters (?v12 ?v7 ?v1)
:precondition (and (pred_9 ?v12) (pred_11 ?v7) (pred_11 ?v1)
                  (pred_7 ?v12) (pred_10 ?v1) (pred_2 ?v7 ?v12))
:effect (and (pred_10 ?v7) (pred_2 ?v1 ?v12)
        (not (pred_10 ?v1)) (not (pred_2 ?v7 ?v12))))

(:action op_4
:parameters (?v12 ?v6)
:precondition (and (pred_9 ?v12) (pred_11 ?v6) 
                  (pred_7 ?v12) (pred_10 ?v6))
:effect (and (pred_1 ) (pred_2 ?v6 ?v12) (not (pred_10 ?v6)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_23 obj_01 obj_05 obj_21 obj_20 obj_04 obj_24 obj_26 obj_18 obj_30 obj_22 obj_14 obj_25 obj_02 obj_28 obj_12 obj_13 obj_09 obj_29 obj_03 obj_17 obj_19 obj_06 obj_10 obj_07
    obj_16 obj_08
    obj_15 obj_27 obj_11
    )

    (:init
       (pred_1)

       (pred_9 obj_23)
       (pred_9 obj_01)
       (pred_9 obj_05)
       (pred_9 obj_21)
       (pred_9 obj_20)
       (pred_9 obj_04)
       (pred_9 obj_24)
       (pred_9 obj_26)
       (pred_9 obj_18)
       (pred_9 obj_30)
       (pred_9 obj_22)
       (pred_9 obj_14)
       (pred_9 obj_25)
       (pred_9 obj_02)
       (pred_9 obj_28)
       (pred_9 obj_12)
       (pred_9 obj_13)
       (pred_9 obj_09)
       (pred_9 obj_29)
       (pred_9 obj_03)
       (pred_9 obj_17)
       (pred_9 obj_19)
       (pred_9 obj_06)
       (pred_9 obj_10)
       (pred_9 obj_07)
       (pred_8 obj_16)
       (pred_8 obj_08)
       (pred_11 obj_15)
       (pred_11 obj_27)
       (pred_11 obj_11)

       (pred_4 obj_23 obj_04)
       (pred_4 obj_23 obj_01)
       (pred_4 obj_01 obj_24)
       (pred_4 obj_01 obj_05)
       (pred_4 obj_01 obj_23)
       (pred_4 obj_05 obj_26)
       (pred_4 obj_05 obj_21)
       (pred_4 obj_05 obj_01)
       (pred_4 obj_21 obj_18)
       (pred_4 obj_21 obj_20)
       (pred_4 obj_21 obj_05)
       (pred_4 obj_20 obj_30)
       (pred_4 obj_20 obj_21)
       (pred_4 obj_04 obj_22)
       (pred_4 obj_04 obj_24)
       (pred_4 obj_04 obj_23)
       (pred_4 obj_24 obj_14)
       (pred_4 obj_24 obj_26)
       (pred_4 obj_24 obj_01)
       (pred_4 obj_24 obj_04)
       (pred_4 obj_26 obj_25)
       (pred_4 obj_26 obj_18)
       (pred_4 obj_26 obj_05)
       (pred_4 obj_26 obj_24)
       (pred_4 obj_18 obj_02)
       (pred_4 obj_18 obj_30)
       (pred_4 obj_18 obj_21)
       (pred_4 obj_18 obj_26)
       (pred_4 obj_30 obj_28)
       (pred_4 obj_30 obj_20)
       (pred_4 obj_30 obj_18)
       (pred_4 obj_22 obj_12)
       (pred_4 obj_22 obj_14)
       (pred_4 obj_22 obj_04)
       (pred_4 obj_14 obj_13)
       (pred_4 obj_14 obj_25)
       (pred_4 obj_14 obj_24)
       (pred_4 obj_14 obj_22)
       (pred_4 obj_25 obj_09)
       (pred_4 obj_25 obj_02)
       (pred_4 obj_25 obj_26)
       (pred_4 obj_25 obj_14)
       (pred_4 obj_02 obj_29)
       (pred_4 obj_02 obj_28)
       (pred_4 obj_02 obj_18)
       (pred_4 obj_02 obj_25)
       (pred_4 obj_28 obj_03)
       (pred_4 obj_28 obj_30)
       (pred_4 obj_28 obj_02)
       (pred_4 obj_12 obj_17)
       (pred_4 obj_12 obj_13)
       (pred_4 obj_12 obj_22)
       (pred_4 obj_13 obj_19)
       (pred_4 obj_13 obj_09)
       (pred_4 obj_13 obj_14)
       (pred_4 obj_13 obj_12)
       (pred_4 obj_09 obj_06)
       (pred_4 obj_09 obj_29)
       (pred_4 obj_09 obj_25)
       (pred_4 obj_09 obj_13)
       (pred_4 obj_29 obj_10)
       (pred_4 obj_29 obj_03)
       (pred_4 obj_29 obj_02)
       (pred_4 obj_29 obj_09)
       (pred_4 obj_03 obj_07)
       (pred_4 obj_03 obj_28)
       (pred_4 obj_03 obj_29)
       (pred_4 obj_17 obj_19)
       (pred_4 obj_17 obj_12)
       (pred_4 obj_19 obj_06)
       (pred_4 obj_19 obj_13)
       (pred_4 obj_19 obj_17)
       (pred_4 obj_06 obj_10)
       (pred_4 obj_06 obj_09)
       (pred_4 obj_06 obj_19)
       (pred_4 obj_10 obj_07)
       (pred_4 obj_10 obj_29)
       (pred_4 obj_10 obj_06)
       (pred_4 obj_07 obj_03)
       (pred_4 obj_07 obj_10)
       (pred_12 obj_20)
       (pred_12 obj_24)
       (pred_12 obj_06)
       (pred_3  obj_20 obj_16)
       (pred_3  obj_24 obj_08)
       (pred_3  obj_06 obj_08)
       (pred_5 obj_23)
       (pred_5 obj_01)
       (pred_5 obj_05)
       (pred_5 obj_21)
       (pred_5 obj_04)
       (pred_5 obj_26)
       (pred_5 obj_18)
       (pred_5 obj_30)
       (pred_5 obj_22)
       (pred_5 obj_14)
       (pred_5 obj_25)
       (pred_5 obj_02)
       (pred_5 obj_28)
       (pred_5 obj_12)
       (pred_5 obj_13)
       (pred_5 obj_09)
       (pred_5 obj_29)
       (pred_5 obj_03)
       (pred_5 obj_17)
       (pred_5 obj_19)
       (pred_5 obj_10)
       (pred_5 obj_07)

       (pred_6  obj_15 obj_16)
       (pred_6  obj_27 obj_08)
       (pred_6  obj_11 obj_08)
       (pred_2 obj_15 obj_23)
       (pred_2 obj_27 obj_18)
       (pred_2 obj_11 obj_09)
       (pred_7 obj_26)
    )

    (:goal (and
       (pred_2 obj_15 obj_07)
       (pred_2 obj_27 obj_05)
    ))
(:constraints
  (always (not (pred_7 obj_21)))
)
)

; plan
1. (op_5 obj_26 obj_18)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_18)
   goals met: 0 of 2
2. (op_2 obj_18 obj_27)
   deleted: (pred_2 obj_27 obj_18) (pred_1)
   added: (pred_10 obj_27)
   goals met: 0 of 2
3. (op_5 obj_18 obj_26)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_26)
   goals met: 0 of 2
4. (op_5 obj_26 obj_05)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_05)
   goals met: 0 of 2
5. (op_4 obj_05 obj_27)
   deleted: (pred_10 obj_27)
   added: (pred_1) (pred_2 obj_27 obj_05)
   goals met: 1 of 2
6. (op_5 obj_05 obj_01)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_01)
   goals met: 1 of 2
7. (op_5 obj_01 obj_23)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_23)
   goals met: 1 of 2
8. (op_2 obj_23 obj_15)
   deleted: (pred_2 obj_15 obj_23) (pred_1)
   added: (pred_10 obj_15)
   goals met: 1 of 2
9. (op_5 obj_23 obj_01)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_01)
   goals met: 1 of 2
10. (op_5 obj_01 obj_05)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_05)
   goals met: 1 of 2
11. (op_5 obj_05 obj_26)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_26)
   goals met: 1 of 2
12. (op_5 obj_26 obj_18)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_18)
   goals met: 1 of 2
13. (op_5 obj_18 obj_30)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_30)
   goals met: 1 of 2
14. (op_5 obj_30 obj_28)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_28)
   goals met: 1 of 2
15. (op_5 obj_28 obj_03)
   deleted: (pred_7 obj_28)
   added: (pred_7 obj_03)
   goals met: 1 of 2
16. (op_5 obj_03 obj_07)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_07)
   goals met: 1 of 2
17. (op_4 obj_07 obj_15)
   deleted: (pred_10 obj_15)
   added: (pred_1) (pred_2 obj_15 obj_07)
   goals met: 2 of 2
